{"config": {"layers": [{"config": {"batch_input_shape": [null, 64, 64, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "conv2d_3", "dtype": "float32", "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_constraint": null, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "filters": 32, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_3", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "name": "conv2d_4", "padding": "valid", "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "strides": [1, 1], "filters": 32, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_4", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_3", "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "activity_regularizer": null, "units": 128, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_4", "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "softmax", "activity_regularizer": null, "units": 3, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}], "name": "sequential_2"}, "backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential"}